snlkuharlocal/src/Documents/ВводВЭксплуатацию/ВводВЭксплуатацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводВЭксплуатацию</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.Категории</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГарантии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/КомпьютерноеОборудование/КомпьютерноеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомпьютерноеОборудование</name>
  <resources>
    <name>НачальнаяЦена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокГарантии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ВводВЭксплуатацию/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим) Экспорт
	рег = РегистрыСведений.КомпьютерноеОборудование;
	Для Каждого стр из  Оборудование Цикл
		Выборка = рег.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИнвентарныйНомер = стр.Номенклатура.Код и Выборка.СерийныйНомер = стр.СерийныйНомер и Выборка.Категория = стр.Категория Тогда
				Выборка.ПолучитьМенеджерЗаписи().Удалить();
				Прервать;
			КонецЕсли;
		КонецЦикла;
        Элемент = Рег.СоздатьМенеджерЗаписи();
        Элемент.ИнвентарныйНомер = стр.Номенклатура.Код;
        Элемент.СерийныйНомер = стр.СерийныйНомер;
        Элемент.Категория = стр.Категория;
        Элемент.СрокГарантии = стр.СрокГарантии;
        Элемент.НачальнаяЦена = стр.НачальнаяЦена;
        Элемент.ДатаВводаВЭксплуатацию = ДатаВводаВЭксплуатацию;
        Элемент.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КомпьютерноеОборудование.ИнвентарныйНомер
		|ИЗ
		|	РегистрСведений.КомпьютерноеОборудование КАК КомпьютерноеОборудование
		|ГДЕ
		|	КомпьютерноеОборудование.ИнвентарныйНомер = &ИнвентарныйНомер";
		ДокОснование = Основание;
		ДатаВводаВЭксплуатацию = Основание.Дата;
		Для Каждого ТекСтрокаТовары Из Основание.Товары Цикл
			Если ТекСтрокаТовары.Номенклатура.Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.КомпьютернаяТехника Тогда
				Если ТекСтрокаТовары.Количество = 1 Тогда
					Запрос.УстановитьПараметр("ИнвентарныйНомер", ТекСтрокаТовары.Номенклатура.Код);
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Количество() = 0 ТОгда
						НоваяСтрока = Оборудование.Добавить();
						НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
						НоваяСтрока.НачальнаяЦена = ТекСтрокаТовары.Цена;
					КонецЕсли;
				Иначе
					Сообщить("По номенклатуре "+ТекСтрокаТовары.Номенклатура+" количество отлично от 1");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	рег = РегистрыСведений.КомпьютерноеОборудование;
	Для Каждого стр из  Оборудование Цикл
		Выборка = рег.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИнвентарныйНомер = стр.Номенклатура.Код и Выборка.СерийныйНомер = стр.СерийныйНомер и Выборка.Категория = стр.Категория Тогда
				Выборка.ПолучитьМенеджерЗаписи().Удалить();
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
